#+TITLE: What I didn't know about Haskell
#+AUTHOR: [[mailto:thibault@thb.lt][Thibault Polge]]

#+LANGUAGE: en
#+OPTIONS: ':t ^:nil

#+SETUPFILE: Code/write-yourself-a-git/org-html-themes/setup/theme-readtheorg.setup

#+begin_src elisp :results silent :exports none
  (require 'ob-haskell)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((dot . t))) ; this line activates dot
#+end_src

#+begin_src haskell :exports none :results silent
  :set +m
  :set prompt "> "
#+end_src

This document isn't the zillionth Monad tutorial; it is a log
of my own study of Haskell's fundamental typeclasses.

Goals of this document:

 - Practical programming, not theory (although we may implement
   natural numbers once or twice)

** coerce
:PROPERTIES:
:custom_id: coerce
:END:

=coerce= (from Data.Coerce) converts at compile-time between types
with the same internal representation, for example =newtype= aliases
of the same underlying type, or back and forth between the underlying
type and =newtype= aliases:

#+begin_src haskell :exports both
  import Data.Coerce
  import Data.Foldable
  import Data.Monoid

  let a = [10, 20, 30] :: [Sum Int]

  fold a
#+end_src

#+RESULTS:
: > > > Prelude Data.Monoid Data.Foldable Data.Coerce| > Sum {getSum = 60}

#+begin_src haskell :exports both
  fold (coerce a :: [Product Int])
#+end_src

#+RESULTS:
: Product {getProduct = 6000}

It's not technically a conversion function, as it cannot actually
convert anything.  Informally, what it actually does is change the
visible type of a piece of data to something else /if and only if/
it's safe to do so, that is, if both types are internally the same.
This won't work:

#+begin_src haskell :exports both
  import Data.Int

  let x = 32 :: Int16

  coerce x :: Int32
#+end_src

#+RESULTS:
: > Prelude Data.Monoid Data.Foldable Data.Coerce Data.Int| >
: <interactive>:229:1-8: error:
:     • Couldn't match representation of type ‘Int16’
:                                with that of ‘Int32’
:         arising from a use of ‘coerce’
:     • In the expression: coerce x :: Int32
:       In an equation for ‘it’: it = coerce x :: Int32

#  LocalWords:  typeclass typeclasses zillionth monoids Semigroup
#  LocalWords:  foldr catamorphism monoid Semigroups
